adamkaliszan/incubator-nuttx/arch/arm/src/stm32wl5/hardware/stm32wl5_dma.h
/* Register Addresses *******************************************************/

#define STM32WL5_DMA1_LISRC          (STM32WL5_DMA1_BASE+STM32WL5_DMA_LISR_OFFSET)
#define STM32WL5_DMA1_HISRC          (STM32WL5_DMA1_BASE+STM32WL5_DMA_HISR_OFFSET)
#define STM32WL5_DMA1_LIFCR          (STM32WL5_DMA1_BASE+STM32WL5_DMA_LIFCR_OFFSET)
#define STM32WL5_DMA1_HIFCR          (STM32WL5_DMA1_BASE+STM32WL5_DMA_HIFCR_OFFSET)

#define STM32WL5_DMA1_SCR(n)         (STM32WL5_DMA1_BASE+STM32WL5_DMA_SCR_OFFSET+STM32WL5_DMA_OFFSET(n))
#define STM32WL5_DMA1_S0CR           (STM32WL5_DMA1_BASE+STM32WL5_DMA_S0CR_OFFSET)
#define STM32WL5_DMA1_S1CR           (STM32WL5_DMA1_BASE+STM32WL5_DMA_S1CR_OFFSET)
#define STM32WL5_DMA1_S2CR           (STM32WL5_DMA1_BASE+STM32WL5_DMA_S2CR_OFFSET)
#define STM32WL5_DMA1_S3CR           (STM32WL5_DMA1_BASE+STM32WL5_DMA_S3CR_OFFSET)
#define STM32WL5_DMA1_S4CR           (STM32WL5_DMA1_BASE+STM32WL5_DMA_S4CR_OFFSET)
#define STM32WL5_DMA1_S5CR           (STM32WL5_DMA1_BASE+STM32WL5_DMA_S5CR_OFFSET)
#define STM32WL5_DMA1_S6CR           (STM32WL5_DMA1_BASE+STM32WL5_DMA_S6CR_OFFSET)
#define STM32WL5_DMA1_S7CR           (STM32WL5_DMA1_BASE+STM32WL5_DMA_S7CR_OFFSET)

#define STM32WL5_DMA1_SNDTR(n)       (STM32WL5_DMA1_BASE+STM32WL5_DMA_SNDTR_OFFSET+STM32WL5_DMA_OFFSET(n))
#define STM32WL5_DMA1_S0NDTR         (STM32WL5_DMA1_BASE+STM32WL5_DMA_S0NDTR_OFFSET)
#define STM32WL5_DMA1_S1NDTR         (STM32WL5_DMA1_BASE+STM32WL5_DMA_S1NDTR_OFFSET)
#define STM32WL5_DMA1_S2NDTR         (STM32WL5_DMA1_BASE+STM32WL5_DMA_S2NDTR_OFFSET)
#define STM32WL5_DMA1_S3NDTR         (STM32WL5_DMA1_BASE+STM32WL5_DMA_S3NDTR_OFFSET)
#define STM32WL5_DMA1_S4NDTR         (STM32WL5_DMA1_BASE+STM32WL5_DMA_S4NDTR_OFFSET)
#define STM32WL5_DMA1_S5NDTR         (STM32WL5_DMA1_BASE+STM32WL5_DMA_S5NDTR_OFFSET)
#define STM32WL5_DMA1_S6NDTR         (STM32WL5_DMA1_BASE+STM32WL5_DMA_S6NDTR_OFFSET)
#define STM32WL5_DMA1_S7NDTR         (STM32WL5_DMA1_BASE+STM32WL5_DMA_S7NDTR_OFFSET)

#define STM32WL5_DMA1_SPAR(n)        (STM32WL5_DMA1_BASE+STM32WL5_DMA_SPAR_OFFSET+STM32WL5_DMA_OFFSET(n))
#define STM32WL5_DMA1_S0PAR          (STM32WL5_DMA1_BASE+STM32WL5_DMA_S0PAR_OFFSET)
#define STM32WL5_DMA1_S1PAR          (STM32WL5_DMA1_BASE+STM32WL5_DMA_S1PAR_OFFSET)
#define STM32WL5_DMA1_S2PAR          (STM32WL5_DMA1_BASE+STM32WL5_DMA_S2PAR_OFFSET)
#define STM32WL5_DMA1_S3PAR          (STM32WL5_DMA1_BASE+STM32WL5_DMA_S3PAR_OFFSET)
#define STM32WL5_DMA1_S4PAR          (STM32WL5_DMA1_BASE+STM32WL5_DMA_S4PAR_OFFSET)
#define STM32WL5_DMA1_S5PAR          (STM32WL5_DMA1_BASE+STM32WL5_DMA_S5PAR_OFFSET)
#define STM32WL5_DMA1_S6PAR          (STM32WL5_DMA1_BASE+STM32WL5_DMA_S6PAR_OFFSET)
#define STM32WL5_DMA1_S7PAR          (STM32WL5_DMA1_BASE+STM32WL5_DMA_S7PAR_OFFSET)

#define STM32WL5_DMA1_SM0AR(n)       (STM32WL5_DMA1_BASE+STM32WL5_DMA_SM0AR_OFFSET+STM32WL5_DMA_OFFSET(n))
#define STM32WL5_DMA1_S0M0AR         (STM32WL5_DMA1_BASE+STM32WL5_DMA_S0M0AR_OFFSET)
#define STM32WL5_DMA1_S1M0AR         (STM32WL5_DMA1_BASE+STM32WL5_DMA_S1M0AR_OFFSET)
#define STM32WL5_DMA1_S2M0AR         (STM32WL5_DMA1_BASE+STM32WL5_DMA_S2M0AR_OFFSET)
#define STM32WL5_DMA1_S3M0AR         (STM32WL5_DMA1_BASE+STM32WL5_DMA_S3M0AR_OFFSET)
#define STM32WL5_DMA1_S4M0AR         (STM32WL5_DMA1_BASE+STM32WL5_DMA_S4M0AR_OFFSET)
#define STM32WL5_DMA1_S5M0AR         (STM32WL5_DMA1_BASE+STM32WL5_DMA_S5M0AR_OFFSET)
#define STM32WL5_DMA1_S6M0AR         (STM32WL5_DMA1_BASE+STM32WL5_DMA_S6M0AR_OFFSET)
#define STM32WL5_DMA1_S7M0AR         (STM32WL5_DMA1_BASE+STM32WL5_DMA_S7M0AR_OFFSET)

#define STM32WL5_DMA1_SM1AR(n)       (STM32WL5_DMA1_BASE+STM32WL5_DMA_SM1AR_OFFSET+STM32WL5_DMA_OFFSET(n))
#define STM32WL5_DMA1_S0M1AR         (STM32WL5_DMA1_BASE+STM32WL5_DMA_S0M1AR_OFFSET)
#define STM32WL5_DMA1_S1M1AR         (STM32WL5_DMA1_BASE+STM32WL5_DMA_S1M1AR_OFFSET)
#define STM32WL5_DMA1_S2M1AR         (STM32WL5_DMA1_BASE+STM32WL5_DMA_S2M1AR_OFFSET)
#define STM32WL5_DMA1_S3M1AR         (STM32WL5_DMA1_BASE+STM32WL5_DMA_S3M1AR_OFFSET)
#define STM32WL5_DMA1_S4M1AR         (STM32WL5_DMA1_BASE+STM32WL5_DMA_S4M1AR_OFFSET)
#define STM32WL5_DMA1_S5M1AR         (STM32WL5_DMA1_BASE+STM32WL5_DMA_S5M1AR_OFFSET)
#define STM32WL5_DMA1_S6M1AR         (STM32WL5_DMA1_BASE+STM32WL5_DMA_S6M1AR_OFFSET)
#define STM32WL5_DMA1_S7M1AR         (STM32WL5_DMA1_BASE+STM32WL5_DMA_S7M1AR_OFFSET)

#define STM32WL5_DMA1_SFCR(n)        (STM32WL5_DMA1_BASE+STM32WL5_DMA_SFCR_OFFSET+STM32WL5_DMA_OFFSET(n))
#define STM32WL5_DMA1_S0FCR          (STM32WL5_DMA1_BASE+STM32WL5_DMA_S0FCR_OFFSET)
#define STM32WL5_DMA1_S1FCR          (STM32WL5_DMA1_BASE+STM32WL5_DMA_S1FCR_OFFSET)
#define STM32WL5_DMA1_S2FCR          (STM32WL5_DMA1_BASE+STM32WL5_DMA_S2FCR_OFFSET)
#define STM32WL5_DMA1_S3FCR          (STM32WL5_DMA1_BASE+STM32WL5_DMA_S3FCR_OFFSET)
#define STM32WL5_DMA1_S4FCR          (STM32WL5_DMA1_BASE+STM32WL5_DMA_S4FCR_OFFSET)
#define STM32WL5_DMA1_S5FCR          (STM32WL5_DMA1_BASE+STM32WL5_DMA_S5FCR_OFFSET)
#define STM32WL5_DMA1_S6FCR          (STM32WL5_DMA1_BASE+STM32WL5_DMA_S6FCR_OFFSET)
#define STM32WL5_DMA1_S7FCR          (STM32WL5_DMA1_BASE+STM32WL5_DMA_S7FCR_OFFSET)

#define STM32WL5_DMA2_LISRC          (STM32WL5_DMA2_BASE+STM32WL5_DMA_LISR_OFFSET)
#define STM32WL5_DMA2_HISRC          (STM32WL5_DMA2_BASE+STM32WL5_DMA_HISR_OFFSET)
#define STM32WL5_DMA2_LIFCR          (STM32WL5_DMA2_BASE+STM32WL5_DMA_LIFCR_OFFSET)
#define STM32WL5_DMA2_HIFCR          (STM32WL5_DMA2_BASE+STM32WL5_DMA_HIFCR_OFFSET)

#define STM32WL5_DMA2_SCR(n)         (STM32WL5_DMA2_BASE+STM32WL5_DMA_SCR_OFFSET+STM32WL5_DMA_OFFSET(n))
#define STM32WL5_DMA2_S0CR           (STM32WL5_DMA2_BASE+STM32WL5_DMA_S0CR_OFFSET)
#define STM32WL5_DMA2_S1CR           (STM32WL5_DMA2_BASE+STM32WL5_DMA_S1CR_OFFSET)
#define STM32WL5_DMA2_S2CR           (STM32WL5_DMA2_BASE+STM32WL5_DMA_S2CR_OFFSET)
#define STM32WL5_DMA2_S3CR           (STM32WL5_DMA2_BASE+STM32WL5_DMA_S3CR_OFFSET)
#define STM32WL5_DMA2_S4CR           (STM32WL5_DMA2_BASE+STM32WL5_DMA_S4CR_OFFSET)
#define STM32WL5_DMA2_S5CR           (STM32WL5_DMA2_BASE+STM32WL5_DMA_S5CR_OFFSET)
#define STM32WL5_DMA2_S6CR           (STM32WL5_DMA2_BASE+STM32WL5_DMA_S6CR_OFFSET)
#define STM32WL5_DMA2_S7CR           (STM32WL5_DMA2_BASE+STM32WL5_DMA_S7CR_OFFSET)

