adamkaliszan/incubator-nuttx/arch/arm/src/stm32wl5/hardware/stm32wl5_dma.h
#define STM32WL5_DMA2_SNDTR(n)       (STM32WL5_DMA2_BASE+STM32WL5_DMA_SNDTR_OFFSET+STM32WL5_DMA_OFFSET(n))
#define STM32WL5_DMA2_S0NDTR         (STM32WL5_DMA2_BASE+STM32WL5_DMA_S0NDTR_OFFSET)
#define STM32WL5_DMA2_S1NDTR         (STM32WL5_DMA2_BASE+STM32WL5_DMA_S1NDTR_OFFSET)
#define STM32WL5_DMA2_S2NDTR         (STM32WL5_DMA2_BASE+STM32WL5_DMA_S2NDTR_OFFSET)
#define STM32WL5_DMA2_S3NDTR         (STM32WL5_DMA2_BASE+STM32WL5_DMA_S3NDTR_OFFSET)
#define STM32WL5_DMA2_S4NDTR         (STM32WL5_DMA2_BASE+STM32WL5_DMA_S4NDTR_OFFSET)
#define STM32WL5_DMA2_S5NDTR         (STM32WL5_DMA2_BASE+STM32WL5_DMA_S5NDTR_OFFSET)
#define STM32WL5_DMA2_S6NDTR         (STM32WL5_DMA2_BASE+STM32WL5_DMA_S6NDTR_OFFSET)
#define STM32WL5_DMA2_S7NDTR         (STM32WL5_DMA2_BASE+STM32WL5_DMA_S7NDTR_OFFSET)

#define STM32WL5_DMA2_SPAR(n)        (STM32WL5_DMA2_BASE+STM32WL5_DMA_SPAR_OFFSET+STM32WL5_DMA_OFFSET(n))
#define STM32WL5_DMA2_S0PAR          (STM32WL5_DMA2_BASE+STM32WL5_DMA_S0PAR_OFFSET)
#define STM32WL5_DMA2_S1PAR          (STM32WL5_DMA2_BASE+STM32WL5_DMA_S1PAR_OFFSET)
#define STM32WL5_DMA2_S2PAR          (STM32WL5_DMA2_BASE+STM32WL5_DMA_S2PAR_OFFSET)
#define STM32WL5_DMA2_S3PAR          (STM32WL5_DMA2_BASE+STM32WL5_DMA_S3PAR_OFFSET)
#define STM32WL5_DMA2_S4PAR          (STM32WL5_DMA2_BASE+STM32WL5_DMA_S4PAR_OFFSET)
#define STM32WL5_DMA2_S5PAR          (STM32WL5_DMA2_BASE+STM32WL5_DMA_S5PAR_OFFSET)
#define STM32WL5_DMA2_S6PAR          (STM32WL5_DMA2_BASE+STM32WL5_DMA_S6PAR_OFFSET)
#define STM32WL5_DMA2_S7PAR          (STM32WL5_DMA2_BASE+STM32WL5_DMA_S7PAR_OFFSET)

#define STM32WL5_DMA2_SM0AR(n)       (STM32WL5_DMA2_BASE+STM32WL5_DMA_SM0AR_OFFSET+STM32WL5_DMA_OFFSET(n))
#define STM32WL5_DMA2_S0M0AR         (STM32WL5_DMA2_BASE+STM32WL5_DMA_S0M0AR_OFFSET)
#define STM32WL5_DMA2_S1M0AR         (STM32WL5_DMA2_BASE+STM32WL5_DMA_S1M0AR_OFFSET)
#define STM32WL5_DMA2_S2M0AR         (STM32WL5_DMA2_BASE+STM32WL5_DMA_S2M0AR_OFFSET)
#define STM32WL5_DMA2_S3M0AR         (STM32WL5_DMA2_BASE+STM32WL5_DMA_S3M0AR_OFFSET)
#define STM32WL5_DMA2_S4M0AR         (STM32WL5_DMA2_BASE+STM32WL5_DMA_S4M0AR_OFFSET)
#define STM32WL5_DMA2_S5M0AR         (STM32WL5_DMA2_BASE+STM32WL5_DMA_S5M0AR_OFFSET)
#define STM32WL5_DMA2_S6M0AR         (STM32WL5_DMA2_BASE+STM32WL5_DMA_S6M0AR_OFFSET)
#define STM32WL5_DMA2_S7M0AR         (STM32WL5_DMA2_BASE+STM32WL5_DMA_S7M0AR_OFFSET)

#define STM32WL5_DMA2_SM1AR(n)       (STM32WL5_DMA2_BASE+STM32WL5_DMA_SM1AR_OFFSET+STM32WL5_DMA_OFFSET(n))
#define STM32WL5_DMA2_S0M1AR         (STM32WL5_DMA2_BASE+STM32WL5_DMA_S0M1AR_OFFSET)
#define STM32WL5_DMA2_S1M1AR         (STM32WL5_DMA2_BASE+STM32WL5_DMA_S1M1AR_OFFSET)
#define STM32WL5_DMA2_S2M1AR         (STM32WL5_DMA2_BASE+STM32WL5_DMA_S2M1AR_OFFSET)
#define STM32WL5_DMA2_S3M1AR         (STM32WL5_DMA2_BASE+STM32WL5_DMA_S3M1AR_OFFSET)
#define STM32WL5_DMA2_S4M1AR         (STM32WL5_DMA2_BASE+STM32WL5_DMA_S4M1AR_OFFSET)
#define STM32WL5_DMA2_S5M1AR         (STM32WL5_DMA2_BASE+STM32WL5_DMA_S5M1AR_OFFSET)
#define STM32WL5_DMA2_S6M1AR         (STM32WL5_DMA2_BASE+STM32WL5_DMA_S6M1AR_OFFSET)
#define STM32WL5_DMA2_S7M1AR         (STM32WL5_DMA2_BASE+STM32WL5_DMA_S7M1AR_OFFSET)

#define STM32WL5_DMA2_SFCR(n)        (STM32WL5_DMA2_BASE+STM32WL5_DMA_SFCR_OFFSET+STM32WL5_DMA_OFFSET(n))
#define STM32WL5_DMA2_S0FCR          (STM32WL5_DMA2_BASE+STM32WL5_DMA_S0FCR_OFFSET)
#define STM32WL5_DMA2_S1FCR          (STM32WL5_DMA2_BASE+STM32WL5_DMA_S1FCR_OFFSET)
#define STM32WL5_DMA2_S2FCR          (STM32WL5_DMA2_BASE+STM32WL5_DMA_S2FCR_OFFSET)
#define STM32WL5_DMA2_S3FCR          (STM32WL5_DMA2_BASE+STM32WL5_DMA_S3FCR_OFFSET)
#define STM32WL5_DMA2_S4FCR          (STM32WL5_DMA2_BASE+STM32WL5_DMA_S4FCR_OFFSET)
#define STM32WL5_DMA2_S5FCR          (STM32WL5_DMA2_BASE+STM32WL5_DMA_S5FCR_OFFSET)
#define STM32WL5_DMA2_S6FCR          (STM32WL5_DMA2_BASE+STM32WL5_DMA_S6FCR_OFFSET)
#define STM32WL5_DMA2_S7FCR          (STM32WL5_DMA2_BASE+STM32WL5_DMA_S7FCR_OFFSET)

/* Register Bitfield Definitions ********************************************/

#define DMA_STREAM_MASK           0x3f
#define DMA_STREAM_FEIF_BIT       (1 << 0)  /* Bit 0: Stream FIFO error interrupt flag */
#define DMA_STREAM_DMEIF_BIT      (1 << 2)  /* Bit 2: Stream direct mode error interrupt flag */
#define DMA_STREAM_TEIF_BIT       (1 << 3)  /* Bit 3: Stream Transfer Error flag */
#define DMA_STREAM_HTIF_BIT       (1 << 4)  /* Bit 4: Stream Half Transfer flag */
#define DMA_STREAM_TCIF_BIT       (1 << 5)  /* Bit 5: Stream Transfer Complete flag */

/* DMA interrupt status register and interrupt flag clear register field
 * definitions
 */

#define DMA_INT_STREAM0_SHIFT     (0)       /* Bits 0-5:   DMA Stream 0 interrupt */
#define DMA_INT_STREAM0_MASK      (DMA_STREAM_MASK <<  DMA_INT_STREAM0_SHIFT)
#define DMA_INT_STREAM1_SHIFT     (6)       /* Bits 6-11:  DMA Stream 1 interrupt */
#define DMA_INT_STREAM1_MASK      (DMA_STREAM_MASK <<  DMA_INT_STREAM1_SHIFT)
#define DMA_INT_STREAM2_SHIFT     (16)      /* Bits 16-21: DMA Stream 2 interrupt */
#define DMA_INT_STREAM2_MASK      (DMA_STREAM_MASK <<  DMA_INT_STREAM2_SHIFT)
#define DMA_INT_STREAM3_SHIFT     (22)      /* Bits 22-27: DMA Stream 3 interrupt */
#define DMA_INT_STREAM3_MASK      (DMA_STREAM_MASK <<  DMA_INT_STREAM3_SHIFT)

#define DMA_INT_STREAM4_SHIFT     (0)       /* Bits 0-5:   DMA Stream 4 interrupt */
#define DMA_INT_STREAM4_MASK      (DMA_STREAM_MASK <<  DMA_INT_STREAM4_SHIFT)
#define DMA_INT_STREAM5_SHIFT     (6)       /* Bits 6-11:  DMA Stream 5 interrupt */
#define DMA_INT_STREAM5_MASK      (DMA_STREAM_MASK <<  DMA_INT_STREAM5_SHIFT)
#define DMA_INT_STREAM6_SHIFT     (16)      /* Bits 16-21: DMA Stream 6 interrupt */
#define DMA_INT_STREAM6_MASK      (DMA_STREAM_MASK <<  DMA_INT_STREAM6_SHIFT)
#define DMA_INT_STREAM7_SHIFT     (22)      /* Bits 22-27: DMA Stream 7 interrupt */
#define DMA_INT_STREAM7_MASK      (DMA_STREAM_MASK <<  DMA_INT_STREAM7_SHIFT)

/* DMA stream configuration register */

#define DMA_SCR_EN                (1 << 0)  /* Bit 0:  Stream enable */
#define DMA_SCR_DMEIE             (1 << 1)  /* Bit 1:  Direct mode error interrupt enable */
#define DMA_SCR_TEIE              (1 << 2)  /* Bit 2:  Transfer error interrupt enable */
#define DMA_SCR_HTIE              (1 << 3)  /* Bit 3:  Half Transfer interrupt enable */
#define DMA_SCR_TCIE              (1 << 4)  /* Bit 4:  Transfer complete interrupt enable */
#define DMA_SCR_PFCTRL            (1 << 5)  /* Bit 5:  Peripheral flow controller */
#define DMA_SCR_DIR_SHIFT         (6)       /* Bits 6-7: Data transfer direction */
#define DMA_SCR_DIR_MASK          (3 << DMA_SCR_DIR_SHIFT)
#  define DMA_SCR_DIR_P2M         (0 << DMA_SCR_DIR_SHIFT) /* 00: Peripheral-to-memory */
#  define DMA_SCR_DIR_M2P         (1 << DMA_SCR_DIR_SHIFT) /* 01: Memory-to-peripheral */
#  define DMA_SCR_DIR_M2M         (2 << DMA_SCR_DIR_SHIFT) /* 10: Memory-to-memory */

