adamkaliszan/incubator-nuttx/arch/arm/src/stm32wl5/hardware/stm32wl5_dma.h
#if defined(CONFIG_STM32WL5_STM32F427) || defined(CONFIG_STM32WL5_STM32F429) || \
    defined(CONFIG_STM32WL5_STM32F469)
#  define DMAMAP_UART8_TX          STM32WL5_DMA_MAP(DMA1,DMA_STREAM0,DMA_CHAN5)
#  define DMAMAP_UART7_TX          STM32WL5_DMA_MAP(DMA1,DMA_STREAM1,DMA_CHAN5)
#endif
#define DMAMAP_TIM3_CH4            STM32WL5_DMA_MAP(DMA1,DMA_STREAM2,DMA_CHAN5)
#define DMAMAP_TIM3_UP             STM32WL5_DMA_MAP(DMA1,DMA_STREAM2,DMA_CHAN5)
#if defined(CONFIG_STM32WL5_STM32F427) || defined(CONFIG_STM32WL5_STM32F429) || \
    defined(CONFIG_STM32WL5_STM32F469)
#  define DMAMAP_UART7_RX          STM32WL5_DMA_MAP(DMA1,DMA_STREAM3,DMA_CHAN5)
#endif
#define DMAMAP_TIM3_CH1            STM32WL5_DMA_MAP(DMA1,DMA_STREAM4,DMA_CHAN5)
#define DMAMAP_TIM3_TRIG           STM32WL5_DMA_MAP(DMA1,DMA_STREAM4,DMA_CHAN5)
#define DMAMAP_TIM3_CH2            STM32WL5_DMA_MAP(DMA1,DMA_STREAM5,DMA_CHAN5)
#if defined(CONFIG_STM32WL5_STM32F427) || defined(CONFIG_STM32WL5_STM32F429) || \
    defined(CONFIG_STM32WL5_STM32F469)
#  define DMAMAP_UART8_RX          STM32WL5_DMA_MAP(DMA1,DMA_STREAM6,DMA_CHAN5)
#endif
#define DMAMAP_TIM3_CH3            STM32WL5_DMA_MAP(DMA1,DMA_STREAM7,DMA_CHAN5)

#define DMAMAP_TIM5_CH3            STM32WL5_DMA_MAP(DMA1,DMA_STREAM0,DMA_CHAN6)
#define DMAMAP_TIM5_UP_1           STM32WL5_DMA_MAP(DMA1,DMA_STREAM0,DMA_CHAN6)
#define DMAMAP_TIM5_CH4_1          STM32WL5_DMA_MAP(DMA1,DMA_STREAM1,DMA_CHAN6)
#define DMAMAP_TIM5_TRIG_1         STM32WL5_DMA_MAP(DMA1,DMA_STREAM1,DMA_CHAN6)
#define DMAMAP_TIM5_CH1            STM32WL5_DMA_MAP(DMA1,DMA_STREAM2,DMA_CHAN6)
#define DMAMAP_TIM5_CH4_2          STM32WL5_DMA_MAP(DMA1,DMA_STREAM3,DMA_CHAN6)
#define DMAMAP_TIM5_TRIG_2         STM32WL5_DMA_MAP(DMA1,DMA_STREAM3,DMA_CHAN6)
#define DMAMAP_TIM5_CH2            STM32WL5_DMA_MAP(DMA1,DMA_STREAM4,DMA_CHAN6)
#define DMAMAP_TIM5_UP_2           STM32WL5_DMA_MAP(DMA1,DMA_STREAM6,DMA_CHAN6)

#define DMAMAP_TIM6_UP             STM32WL5_DMA_MAP(DMA1,DMA_STREAM1,DMA_CHAN7)
#define DMAMAP_I2C2_RX_1           STM32WL5_DMA_MAP(DMA1,DMA_STREAM2,DMA_CHAN7)
#define DMAMAP_I2C2_RX_2           STM32WL5_DMA_MAP(DMA1,DMA_STREAM3,DMA_CHAN7)
#define DMAMAP_USART3_TX_2         STM32WL5_DMA_MAP(DMA1,DMA_STREAM4,DMA_CHAN7)
#define DMAMAP_DAC1_CH1            STM32WL5_DMA_MAP(DMA1,DMA_STREAM5,DMA_CHAN7)
#define DMAMAP_DAC1_CH2            STM32WL5_DMA_MAP(DMA1,DMA_STREAM6,DMA_CHAN7)
#define DMAMAP_I2C2_TX             STM32WL5_DMA_MAP(DMA1,DMA_STREAM7,DMA_CHAN7)

#define DMAMAP_ADC1_1              STM32WL5_DMA_MAP(DMA2,DMA_STREAM0,DMA_CHAN0)
#define DMAMAP_TIM8_CH1_1          STM32WL5_DMA_MAP(DMA2,DMA_STREAM2,DMA_CHAN0)
#define DMAMAP_TIM8_CH2_1          STM32WL5_DMA_MAP(DMA2,DMA_STREAM2,DMA_CHAN0)
#define DMAMAP_TIM8_CH3_1          STM32WL5_DMA_MAP(DMA2,DMA_STREAM2,DMA_CHAN0)
#define DMAMAP_ADC1_2              STM32WL5_DMA_MAP(DMA2,DMA_STREAM4,DMA_CHAN0)
#define DMAMAP_TIM1_CH1_1          STM32WL5_DMA_MAP(DMA2,DMA_STREAM6,DMA_CHAN0)
#define DMAMAP_TIM1_CH2_1          STM32WL5_DMA_MAP(DMA2,DMA_STREAM6,DMA_CHAN0)
#define DMAMAP_TIM1_CH3_1          STM32WL5_DMA_MAP(DMA2,DMA_STREAM6,DMA_CHAN0)

#define DMAMAP_DCMI_1              STM32WL5_DMA_MAP(DMA2,DMA_STREAM1,DMA_CHAN1)
#define DMAMAP_ADC2_1              STM32WL5_DMA_MAP(DMA2,DMA_STREAM2,DMA_CHAN1)
#define DMAMAP_ADC2_2              STM32WL5_DMA_MAP(DMA2,DMA_STREAM3,DMA_CHAN1)
#if defined(CONFIG_STM32WL5_STM32F427) || defined(CONFIG_STM32WL5_STM32F429) || \
    defined(CONFIG_STM32WL5_STM32F469)
#  define DMAMAP_SPI6_TX           STM32WL5_DMA_MAP(DMA2,DMA_STREAM5,DMA_CHAN1)
#  define DMAMAP_SPI6_RX           STM32WL5_DMA_MAP(DMA2,DMA_STREAM6,DMA_CHAN1)
#endif
#define DMAMAP_DCMI_2              STM32WL5_DMA_MAP(DMA2,DMA_STREAM7,DMA_CHAN1)

#define DMAMAP_ADC3_1              STM32WL5_DMA_MAP(DMA2,DMA_STREAM0,DMA_CHAN2)
#define DMAMAP_ADC3_2              STM32WL5_DMA_MAP(DMA2,DMA_STREAM1,DMA_CHAN2)
#if defined(CONFIG_STM32WL5_STM32F427) || defined(CONFIG_STM32WL5_STM32F429) || \
    defined(CONFIG_STM32WL5_STM32F469)
#  define DMAMAP_SPI5_RX_1         STM32WL5_DMA_MAP(DMA2,DMA_STREAM3,DMA_CHAN2)
#  define DMAMAP_SPI5_TX_1         STM32WL5_DMA_MAP(DMA2,DMA_STREAM4,DMA_CHAN2)
#endif
#define DMAMAP_CRYP_OUT            STM32WL5_DMA_MAP(DMA2,DMA_STREAM5,DMA_CHAN2)
#define DMAMAP_CRYP_IN             STM32WL5_DMA_MAP(DMA2,DMA_STREAM6,DMA_CHAN2)
#define DMAMAP_HASH_IN             STM32WL5_DMA_MAP(DMA2,DMA_STREAM7,DMA_CHAN2)

#define DMAMAP_SPI1_RX_1           STM32WL5_DMA_MAP(DMA2,DMA_STREAM0,DMA_CHAN3)
#define DMAMAP_SPI1_RX_2           STM32WL5_DMA_MAP(DMA2,DMA_STREAM2,DMA_CHAN3)
#define DMAMAP_SPI1_TX_1           STM32WL5_DMA_MAP(DMA2,DMA_STREAM3,DMA_CHAN3)
#define DMAMAP_SPI1_TX_2           STM32WL5_DMA_MAP(DMA2,DMA_STREAM5,DMA_CHAN3)

#if defined(CONFIG_STM32WL5_STM32F427) || defined(CONFIG_STM32WL5_STM32F429) || \
    defined(CONFIG_STM32WL5_STM32F446) || defined(CONFIG_STM32WL5_STM32F469)
#  define DMAMAP_SPI4_RX_1         STM32WL5_DMA_MAP(DMA2,DMA_STREAM0,DMA_CHAN4)
#  define DMAMAP_SPI4_TX_1         STM32WL5_DMA_MAP(DMA2,DMA_STREAM1,DMA_CHAN4)
#endif
#define DMAMAP_USART1_RX_1         STM32WL5_DMA_MAP(DMA2,DMA_STREAM2,DMA_CHAN4)
#define DMAMAP_SDIO_1              STM32WL5_DMA_MAP(DMA2,DMA_STREAM3,DMA_CHAN4)
#define DMAMAP_USART1_RX_2         STM32WL5_DMA_MAP(DMA2,DMA_STREAM5,DMA_CHAN4)
#define DMAMAP_SDIO_2              STM32WL5_DMA_MAP(DMA2,DMA_STREAM6,DMA_CHAN4)
#define DMAMAP_USART1_TX           STM32WL5_DMA_MAP(DMA2,DMA_STREAM7,DMA_CHAN4)

#define DMAMAP_USART6_RX_1         STM32WL5_DMA_MAP(DMA2,DMA_STREAM1,DMA_CHAN5)
#define DMAMAP_USART6_RX_2         STM32WL5_DMA_MAP(DMA2,DMA_STREAM2,DMA_CHAN5)
#if defined(CONFIG_STM32WL5_STM32F427) || defined(CONFIG_STM32WL5_STM32F429) || \
    defined(CONFIG_STM32WL5_STM32F446) || defined(CONFIG_STM32WL5_STM32F469)
#  define DMAMAP_SPI4_RX_2         STM32WL5_DMA_MAP(DMA2,DMA_STREAM3,DMA_CHAN5)
#  define DMAMAP_SPI4_TX_2         STM32WL5_DMA_MAP(DMA2,DMA_STREAM4,DMA_CHAN5)
#endif
#define DMAMAP_USART6_TX_1         STM32WL5_DMA_MAP(DMA2,DMA_STREAM6,DMA_CHAN5)
#define DMAMAP_USART6_TX_2         STM32WL5_DMA_MAP(DMA2,DMA_STREAM7,DMA_CHAN5)

#define DMAMAP_TIM1_TRIG_1         STM32WL5_DMA_MAP(DMA2,DMA_STREAM0,DMA_CHAN6)
#define DMAMAP_TIM1_CH1_2          STM32WL5_DMA_MAP(DMA2,DMA_STREAM1,DMA_CHAN6)
#define DMAMAP_TIM1_CH2_2          STM32WL5_DMA_MAP(DMA2,DMA_STREAM2,DMA_CHAN6)
#define DMAMAP_TIM1_CH1            STM32WL5_DMA_MAP(DMA2,DMA_STREAM3,DMA_CHAN6)
#define DMAMAP_TIM1_CH4            STM32WL5_DMA_MAP(DMA2,DMA_STREAM4,DMA_CHAN6)
#define DMAMAP_TIM1_TRIG_2         STM32WL5_DMA_MAP(DMA2,DMA_STREAM4,DMA_CHAN6)
#define DMAMAP_TIM1_COM            STM32WL5_DMA_MAP(DMA2,DMA_STREAM4,DMA_CHAN6)
#define DMAMAP_TIM1_UP             STM32WL5_DMA_MAP(DMA2,DMA_STREAM5,DMA_CHAN6)
#define DMAMAP_TIM1_CH3_2          STM32WL5_DMA_MAP(DMA2,DMA_STREAM6,DMA_CHAN6)

#define DMAMAP_TIM8_UP             STM32WL5_DMA_MAP(DMA2,DMA_STREAM1,DMA_CHAN7)
#define DMAMAP_TIM8_CH1_2          STM32WL5_DMA_MAP(DMA2,DMA_STREAM2,DMA_CHAN7)
#define DMAMAP_TIM8_CH2_2          STM32WL5_DMA_MAP(DMA2,DMA_STREAM3,DMA_CHAN7)
#define DMAMAP_TIM8_CH3_2          STM32WL5_DMA_MAP(DMA2,DMA_STREAM4,DMA_CHAN7)
#if defined(CONFIG_STM32WL5_STM32F427) || defined(CONFIG_STM32WL5_STM32F429) || \
    defined(CONFIG_STM32WL5_STM32F469)
#  define DMAMAP_SPI5_RX_2         STM32WL5_DMA_MAP(DMA2,DMA_STREAM5,DMA_CHAN7)
#  define DMAMAP_SPI5_TX_2         STM32WL5_DMA_MAP(DMA2,DMA_STREAM6,DMA_CHAN7)
#endif
#define DMAMAP_TIM8_CH4            STM32WL5_DMA_MAP(DMA2,DMA_STREAM7,DMA_CHAN7)
#define DMAMAP_TIM8_TRIG           STM32WL5_DMA_MAP(DMA2,DMA_STREAM7,DMA_CHAN7)
#define DMAMAP_TIM8_COM            STM32WL5_DMA_MAP(DMA2,DMA_STREAM7,DMA_CHAN7)

#endif /* __ARCH_ARM_SRC_STM32WL5_HARDWARE_STM32WL5_DMA_V2_H */
